app/channels/chat_channel.rb

  def subscribed
    @chat = Channel.find_by(id: params[:id])
---
SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def speak(data)
    debugger
    message = Message.create!(
      body: data['message'],
      author_id: data['author_id'],
      messagable_id: data['channel_id'],
      messagable_type: 'Channel'
    )
---
INSERT INTO "messages" ("body", "messagable_id", "created_at", "updated_at", "author_id", "messagable_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "12313123"], ["messagable_id", 13], ["created_at", "2021-06-10 18:16:37.948540"], ["updated_at", "2021-06-10 18:16:37.948540"], ["author_id", 1], ["messagable_type", "Channel"]]