app/views/api/users/_all_servers.json.jbuilder

SELECT "servers".* FROM "servers"
---
Server.all.each do |server|